package main

import "fmt"

/*
	คุณได้รับข้อมูลของรายชื่อหนังสือในห้องสมุดพร้อมกับจำนวนครั้งที่มีการยืมหนังสือแต่ละเล่ม ข้อมูลนี้ถูกเก็บไว้ในรูปแบบของอาร์เรย์ที่แสดงจำนวนครั้งที่ยืมของหนังสือแต่ละเล่ม จงเขียนโปรแกรมเพื่อเรียงลำดับข้อมูลนี้จากจำนวนการยืมน้อยที่สุดไปมากที่สุดโดยใช้ Quick Sort และแสดงลำดับใหม่หลังจากการเรียงเสร็จสิ้น

	ตัวอย่าง:
		- อินพุต: arr := []int{15, 3, 27, 10, 6, 21, 8}
		- เอาต์พุต: Sorted array: [3, 6, 8, 10, 15, 21, 27]
	เงื่อนไขเพิ่มเติม:
		- ข้อมูลอาร์เรย์ที่ให้มามีขนาดไม่เกิน 1000 รายการ
		- ต้องการให้การเรียงลำดับทำได้ภายในเวลาที่เหมาะสมสำหรับการประมวลผลข้อมูลขนาดใหญ่

	***การวิเคราะห์ประสิทธิภาพ***
		- กรณีเฉลี่ยและกรณีที่ดีที่สุด: 𝑂(𝑛 log 𝑛)
		- กรณีที่แย่ที่สุด (เมื่อ pivot แย่ เช่น ข้อมูลเรียงลำดับอยู่แล้ว): O(n²)
*/

func quickSort(arr []int) []int {
	// ถ้าข้อมูลอาร์เรย์มีค่าเท่ากับ 1 หรือน้อยกว่า 1 จะคืนค่าเดิม เนื่องจากมันเรียงลำดับอยู่แล้ว ตย. [30]
	if len(arr) <= 1 {
		return arr
	}

	pivot := arr[len(arr)/2] // ให้ pivot เป็นค่ากลางของอาร์เรย์
	left := make([]int, 0)
	right := make([]int, 0)
	middle := make([]int, 0)

	for _, v := range arr {
		if v < pivot { // ค่าปัจจุบันน้อยกว่า pivot เพิ่มใน left
			left = append(left, v)
		} else if v > pivot { // ค่าปัจจุบันมากกว่า pivot เพิ่มใน right
			right = append(right, v)
		} else { // ถ้าเท่ากับ pivot เพิ่มใน middle
			middle = append(middle, v)
		}
	}

	// เรียกใช้ quickSort กับ left/right เพื่อเรียงลำดับซ้ำ จนกว่าจะได้อะเรย์ที่มีขนาดเล็กที่สุด(ที่เรียงลำดับแล้ว)
	left = quickSort(left)
	right = quickSort(right)

	return append(append(left, middle...), right...)
}

func main() {
	arr := []int{15, 3, 27, 10, 6, 21, 8}
	sortedArr := quickSort(arr)
	fmt.Println("Sorted array:", sortedArr)
}
