package main

import "fmt"

/*
	ในหมู่บ้านแห่งหนึ่ง หมายเลขบ้านทั้งหมดถูกจัดเรียงในลำดับจากน้อยไปมากในถนนเส้นหนึ่ง เจ้าหน้าที่ไปรษณีย์ต้องการค้นหาหมายเลขบ้านที่ต้องไปส่งจดหมายให้โดยเร็วที่สุด คุณได้รับข้อมูลดังนี้:
	- รายการหมายเลขบ้านที่เรียงลำดับไว้แล้วในถนน เช่น [101, 102, 103, 104, 105, 106, 107, 108, 109]
	- หมายเลขบ้านที่ต้องการค้นหา (target) เช่น 105

	คำถาม: ค้นหาว่าหมายเลขบ้านที่ต้องการอยู่ที่ตำแหน่งใดในลิสต์ หากเจอให้แสดงผลตำแหน่งของหมายเลขบ้าน หากไม่เจอให้แสดงข้อความว่า "Not found".
	เงื่อนไขเพิ่มเติม:
		- ลิสต์ของหมายเลขบ้านจะมีความยาวตั้งแต่ 1 ถึง 10^6 หมายเลข
		- หมายเลขบ้านทั้งหมดจะไม่ซ้ำกันและเรียงลำดับจากน้อยไปมากเสมอ

	***การวิเคราะห์ประสิทธิภาพ***
		- ดำเนินการในเวลา O(log n)
*/

func binarySearch(arr []int, target int) int {
	low, high := 0, len(arr)-1 //กำหนดขอบเขตเริ่มต้นและสิ้นสุดของการค้นหา

	for low <= high { //การวนลูปนี้จะลดการค้นหาครึ่งหนึ่งในแต่ละรอบ
		mid := (low + high) / 2 //หาค่าจุดกึ่งกลาง โดย บวก low กับค่าครึ่งหนึ่งของช่วง low,high

		if arr[mid] == target { //หาค่าตำแหน่งกลาง เท่ากับค่าที่ต้องการ
			return mid
		} else if arr[mid] < target { //หาค่าตำแหน่งกลาง น้อยกว่าค่าที่ต้องการ
			low = mid + 1 //อยู่ทางขวามือของค่ากลาง low+1
		} else {
			high = mid - 1 //อยู่ทางซ้ายของค่ากลาง high-1
		}
	}

	return -1 //ไม่พบค่าที่ต้องการในลิสต์
}

func main() {
	arr := []int{101, 102, 103, 104, 105, 106, 107, 108, 109}
	target := 105

	index := binarySearch(arr, target)
	fmt.Println("Element found at index:", index)
}
